
main_menu = ''' \nГлавное меню
    1. Открыть телефонную книгу
    2. Сохранить телефонную книгу
    3. Показать контакты
    4. Добавить контакт
    5. Найти контакт
    6. Изменить контакт
    7. Удалить контакт
    0. Выход\n '''

edit_menu = ''' \nЧто делать?
    1. Изменить номер
    2. Изменить ФИО
    3. Изменить номер телефона
    4. Изменить комментарий
    5. Отобразить редактируемый контакт
    0. Выход\n '''

choice_message = "Введите номер пункта меню: "

###choice_num_menu = "Выбран пункт меню"

choice_not_existing_item = "Такого пункта меню нет. Повторите ввод. "

open_without_error = "Телефонный справочник успешно открыт"

delete_message = "Удаляется запись: "

edit_message = "Введите номер записи для редактирования: "

remove_message = "Введите номер записи для удаления: "

enter_FIO = "Ведите ФИО: "

enter_pn = "Ведите номер телефона: "

enter_rem = "Ведите комментарий: "

enter_new_num = "Введите новый порядковый номер строки: "

enter_name_file_pb = "Введите имя файла телефонной книги, Или оставьте поле пустым для значения phonebook.txt"

enter_new_FIO = "Введите другое ФИО: "

enter_new_num = "Введите новый телефонный номер: "

enter_new_rem = "Введите новый комментарий: "

reenter_num = "Нечего удалять, повторите ввод номера записи"

reenter_edit = "Нечего редактировать, повторите ввод номера записи"

editing = "Редактируем: "

good_bye = " Завершаем работу."





